package com.epam.khalii.Parcer;

public class Main {

    /**
     * —оздать приложение дл€ разбора XML-документа
     * и инициализации коллекции объектов информацией
     * из XML-файла. ƒл€ разбора использовать SAX, DOM
     * и StAX парсеры, DOM2, JSON.
     * ƒл€ сортировки объектов использовать интерфейс Comparator.
     * 2. јлмазный фонд.
     * ƒрагоценные и полудрагоценные камни,
     * содержащиес€ в павильоне, имеют следующие характеристики:
     * ЧName Ч название камн€;
     * ЧPreciousness Ч может быть драгоценным либо полудрагоценным;
     * ЧOrigin Ч место добывани€;
     * ЧVisual parameters (должно быть несколько)
     * Ч могут быть: цвет (зеленый, красный, желтый и т. д.),
     * прозрачность (измер€етс€ в процентах 0Ц100 %),
     * способы огранки (количество граней 4Ц15);
     * ЧValue Ч вес камн€ (измер€етс€ в каратах).
     *  орневой элемент назвать Gem.
     * */

    public static void main(String[] args) {

    }
}
